Tasks/Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Task>
		<Properties>
			<Name>Заявка</Name>
			<Addressing>InformationRegister.СопоставлениеАдресации</Addressing>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Делегировать</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВВодаКомментария</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<AddressingAttribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ФункционалВТекущейИБ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункционалВТекущейИБ</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

Enums/ШагЗадачи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ШагЗадачи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
					<Comment>0</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятиеВРаботу</Name>
					<Comment>1</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исполнение</Name>
					<Comment>2</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершение</Name>
					<Comment>3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказ</Name>
					<Comment>4</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Tasks/Заявка/Forms/ФормаЗадачи/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Делегировать = 1;
	Объект.Делегировать = ТекПользователь;
	ЗаявительФИО = Объект.БизнесПроцесс.ЗаявительФИО;
	Объект.Наименование = Объект.ТочкаМаршрута.Имя; 
	Объект.Комментарий  = Объект.БизнесПроцесс.Комментарий;
	
	Для Каждого док Из Объект.БизнесПроцесс.Файлы Цикл		
		файлКопия = Файлы.Добавить();
		ЗаполнитьЗначенияСвойств(файлКопия, док);
		файлКопия.Адрес = ПолучитьНавигационнуюСсылку(Объект.БизнесПроцесс,"Файлы.ДанныеФайла", док.НомерСтроки-1);
	КонецЦикла;
	
	Если Объект.БизнесПроцесс.ШагЗадачи = Перечисления.ШагЗадачи.Корректировка Тогда
		Элементы.ГруппаДелегировать.Видимость = ЛОЖЬ;
		Делегировать = Константы.ПолучательПервичногоДокумента.Получить();
	КонецЕсли;
КонецПроцедуры

#Область работаСФайлом

&НаКлиенте
Процедура ЗагрузитьФайл(Команда)
	ДобавитьФайлВБД();
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьФайл(Команда)
	СохранитьФайлНаДиск();
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьФайлВБД()
	Перем ВыбранноеИмя, АдресВременногоХранилища;	
	    ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
		    
	    ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	    ДиалогОткрытияФайла.Заголовок = "Выберите файл для загрузки";
	    ДиалогОткрытияФайла.Фильтр = "Все файлы (*.*)|*.*|Документ PDF(*.pdf)|*.pdf|HTML(*.html)|*.html;*.htm";
	    ДиалогОткрытияФайла.ПредварительныйПросмотр = Истина; 
	    ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
		
	    Если ДиалогОткрытияФайла.Выбрать() Тогда
	        ПолныйПутьКФайлу= ДиалогОткрытияФайла.ПолноеИмяФайла; 
			
			КороткоеИмя = Сред(ДиалогОткрытияФайла.ПолноеИмяФайла, СтрДлина(ДиалогОткрытияФайла.Каталог) + 1);
			Если ПоместитьФайл(АдресВременногоХранилища, ПолныйПутьКФайлу, ВыбранноеИмя, Ложь, УникальныйИдентификатор) Тогда
	            Изображение = АдресВременногоХранилища;
			КонецЕсли;
			
			НовыйФайл = Файлы.Добавить();
			НовыйФайл.ИмяФайла = КороткоеИмя;
			НовыйФайл.Адрес = АдресВременногоХранилища;
			НовыйФайл.УИД = Новый УникальныйИдентификатор();
			
			выбратьФайлНаСервере(АдресВременногоХранилища, КороткоеИмя, НовыйФайл.УИД);
			//ЭтаФорма.Прочитать();
			
		КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлНаДиск()
	тд = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные;
	АдресФайла = тд.Адрес;
	ИмяФайла = тд.ИмяФайла;
	ПолучитьФайл(АдресФайла, ИмяФайла);	
КонецПроцедуры

&НаСервере
Процедура выбратьФайлНаСервере(Адрес, ВыбранноеИмяФайла, УИД)		
	о = Объект.БизнесПроцесс.ПолучитьОбъект();
	
	НовыйЭлемент = о.Файлы.Добавить();    

	НовыйЭлемент.ИмяФайла = ВыбранноеИмяФайла;
	НовыйЭлемент.ДанныеФайла = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Адрес) );
	НовыйЭлемент.УИД = УИД;

	о.Записать();
КонецПроцедуры

&НаСервере
Процедура УдалитьФайлыОбкНаСервере(УИД)
	о = Объект.БизнесПроцесс.ПолучитьОбъект();	
	строки = о.Файлы.НайтиСтроки( Новый Структура("УИД", УИД) );
	о.Файлы.Удалить( строки[0] );
	о.Записать();
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДелегироватьПриИзменении(Элемент)
	Элементы.Делегировать1.Видимость = Делегировать = 2;
	Элементы.Делегировать1.ТолькоПросмотр = Делегировать <> 2;
	
	Если Делегировать <> 2 Тогда
		Объект.Делегировать = ?(Делегировать = 0, ЗаявительФИО, ТекПользователь);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура КорректировкаНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Корректировка(Команда)
	КорректировкаНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПередВыполнением(Отказ)
	Если (НЕ ЗначениеЗаполнено(Объект.Делегировать)) Тогда
		Сообщить("Не указан сотрудник");
		Отказ = ИСТИНА;
		Возврат;
	КонецЕсли;
	
	 КопироватьИзТчФайлыФормыВТчОбк();
КонецПроцедуры

&НаСервере
Процедура КопироватьИзТчФайлыФормыВТчОбк()
	о = Объект.БизнесПроцесс.ПолучитьОбъект();	
	Для Каждого файл Из Файлы Цикл
		строки = о.Файлы.НайтиСтроки( Новый Структура("УИД", файл.УИД) );
		строки[0].Комментарий = файл.Комментарий;		
	КонецЦикла;
	о.Записать();
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПослеУдаления(Элемент)
	//УИД = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.УИД;
	//УдалитьФайлыОбкНаСервере(УИД);
	//ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура ОтказНаСервере()
	обк = Объект.БизнесПроцесс.ПолучитьОбъект();
	обк.Завершен = ИСТИНА;
	обк.Отказано = ИСТИНА;
	обк.ШагЗадачи = Перечисления.ШагЗадачи.Отказ;
	обк.Исполнитель = Справочники.Пользователи.ПустаяСсылка();
	обк.Заблокировать();
	обк.ШагЗадачи = Перечисления.ШагЗадачи.Отказ;
	обк.Записать();
	
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура Отказ(Команда)
	ОтказНаСервере();
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ФайлыПередУдалением(Элемент, Отказ)
	УИД = ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.УИД;
	УдалитьФайлыОбкНаСервере(УИД);
	// ЭтаФорма.Прочитать();
КонецПроцедуры
